zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxDma_reg.h
/** \brief 2EF0, DMARAM Channel 119 Address and Interrupt Control Register */
#define DMA_CH119_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012EF0u)
/** Alias (User Manual Name) for DMA_CH119_ADICR.
* To use register names with standard convension, please use DMA_CH119_ADICR.
*/
#define DMA_ADICR119 (DMA_CH119_ADICR)

/** \brief 2EF4, DMARAM Channel 119 Configuration Register */
#define DMA_CH119_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012EF4u)
/** Alias (User Manual Name) for DMA_CH119_CHCFGR.
* To use register names with standard convension, please use DMA_CH119_CHCFGR.
*/
#define DMA_CHCFGR119 (DMA_CH119_CHCFGR)

/** \brief 2EF8, DMARAM Channel 119 Shadow Address Register */
#define DMA_CH119_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012EF8u)
/** Alias (User Manual Name) for DMA_CH119_SHADR.
* To use register names with standard convension, please use DMA_CH119_SHADR.
*/
#define DMA_SHADR119 (DMA_CH119_SHADR)

/** \brief 2EFC, DMARAM Channel 119 Control and Status Register */
#define DMA_CH119_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012EFCu)
/** Alias (User Manual Name) for DMA_CH119_CHCSR.
* To use register names with standard convension, please use DMA_CH119_CHCSR.
*/
#define DMA_CHCSR119 (DMA_CH119_CHCSR)

/** \brief 2F00, DMARAM Channel 120 Read Data CRC Register */
#define DMA_CH120_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F00u)
/** Alias (User Manual Name) for DMA_CH120_RDCRCR.
* To use register names with standard convension, please use DMA_CH120_RDCRCR.
*/
#define DMA_RDCRCR120 (DMA_CH120_RDCRCR)

/** \brief 2F04, DMARAM Channel 120 Source and Destination Address CRC Register */
#define DMA_CH120_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F04u)
/** Alias (User Manual Name) for DMA_CH120_SDCRCR.
* To use register names with standard convension, please use DMA_CH120_SDCRCR.
*/
#define DMA_SDCRCR120 (DMA_CH120_SDCRCR)

/** \brief 2F08, DMARAM Channel 120 Source Address Register */
#define DMA_CH120_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F08u)
/** Alias (User Manual Name) for DMA_CH120_SADR.
* To use register names with standard convension, please use DMA_CH120_SADR.
*/
#define DMA_SADR120 (DMA_CH120_SADR)

/** \brief 2F0C, DMARAM Channel 120 Destination Address Register */
#define DMA_CH120_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F0Cu)
/** Alias (User Manual Name) for DMA_CH120_DADR.
* To use register names with standard convension, please use DMA_CH120_DADR.
*/
#define DMA_DADR120 (DMA_CH120_DADR)

/** \brief 2F10, DMARAM Channel 120 Address and Interrupt Control Register */
#define DMA_CH120_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F10u)
/** Alias (User Manual Name) for DMA_CH120_ADICR.
* To use register names with standard convension, please use DMA_CH120_ADICR.
*/
#define DMA_ADICR120 (DMA_CH120_ADICR)

/** \brief 2F14, DMARAM Channel 120 Configuration Register */
#define DMA_CH120_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F14u)
/** Alias (User Manual Name) for DMA_CH120_CHCFGR.
* To use register names with standard convension, please use DMA_CH120_CHCFGR.
*/
#define DMA_CHCFGR120 (DMA_CH120_CHCFGR)

/** \brief 2F18, DMARAM Channel 120 Shadow Address Register */
#define DMA_CH120_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F18u)
/** Alias (User Manual Name) for DMA_CH120_SHADR.
* To use register names with standard convension, please use DMA_CH120_SHADR.
*/
#define DMA_SHADR120 (DMA_CH120_SHADR)

/** \brief 2F1C, DMARAM Channel 120 Control and Status Register */
#define DMA_CH120_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F1Cu)
/** Alias (User Manual Name) for DMA_CH120_CHCSR.
* To use register names with standard convension, please use DMA_CH120_CHCSR.
*/
#define DMA_CHCSR120 (DMA_CH120_CHCSR)

/** \brief 2F20, DMARAM Channel 121 Read Data CRC Register */
#define DMA_CH121_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F20u)
/** Alias (User Manual Name) for DMA_CH121_RDCRCR.
* To use register names with standard convension, please use DMA_CH121_RDCRCR.
*/
#define DMA_RDCRCR121 (DMA_CH121_RDCRCR)

/** \brief 2F24, DMARAM Channel 121 Source and Destination Address CRC Register */
#define DMA_CH121_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F24u)
/** Alias (User Manual Name) for DMA_CH121_SDCRCR.
* To use register names with standard convension, please use DMA_CH121_SDCRCR.
*/
#define DMA_SDCRCR121 (DMA_CH121_SDCRCR)

/** \brief 2F28, DMARAM Channel 121 Source Address Register */
#define DMA_CH121_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F28u)
/** Alias (User Manual Name) for DMA_CH121_SADR.
* To use register names with standard convension, please use DMA_CH121_SADR.
*/
#define DMA_SADR121 (DMA_CH121_SADR)

/** \brief 2F2C, DMARAM Channel 121 Destination Address Register */
#define DMA_CH121_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F2Cu)
/** Alias (User Manual Name) for DMA_CH121_DADR.
* To use register names with standard convension, please use DMA_CH121_DADR.
*/
#define DMA_DADR121 (DMA_CH121_DADR)

/** \brief 2F30, DMARAM Channel 121 Address and Interrupt Control Register */
#define DMA_CH121_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F30u)
/** Alias (User Manual Name) for DMA_CH121_ADICR.
* To use register names with standard convension, please use DMA_CH121_ADICR.
*/
#define DMA_ADICR121 (DMA_CH121_ADICR)

/** \brief 2F34, DMARAM Channel 121 Configuration Register */
#define DMA_CH121_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F34u)
/** Alias (User Manual Name) for DMA_CH121_CHCFGR.
* To use register names with standard convension, please use DMA_CH121_CHCFGR.
*/
#define DMA_CHCFGR121 (DMA_CH121_CHCFGR)

/** \brief 2F38, DMARAM Channel 121 Shadow Address Register */
#define DMA_CH121_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F38u)
/** Alias (User Manual Name) for DMA_CH121_SHADR.
* To use register names with standard convension, please use DMA_CH121_SHADR.
*/
#define DMA_SHADR121 (DMA_CH121_SHADR)

/** \brief 2F3C, DMARAM Channel 121 Control and Status Register */
#define DMA_CH121_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F3Cu)
/** Alias (User Manual Name) for DMA_CH121_CHCSR.
* To use register names with standard convension, please use DMA_CH121_CHCSR.
*/
#define DMA_CHCSR121 (DMA_CH121_CHCSR)

/** \brief 2F40, DMARAM Channel 122 Read Data CRC Register */
#define DMA_CH122_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F40u)
/** Alias (User Manual Name) for DMA_CH122_RDCRCR.
* To use register names with standard convension, please use DMA_CH122_RDCRCR.
*/
#define DMA_RDCRCR122 (DMA_CH122_RDCRCR)

